# WidthScale Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..WidthScale Property
TextNode Class See Also
---
Scale applied to the width of the text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double WidthScale { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WidthScale As Double
	Get
```

Visual C++
---
```text
public:
property double WidthScale {
	double get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace